profitbricks/src/test/resources/loadbalancer/loadbalancer-update.xml

<soapenv:Envelope
  xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/'
  xmlns:ws='http://ws.api.profitbricks.com/'>
    <soapenv:Header />
    <soapenv:Body>
        <ws:updateLoadBalancer>
            <request>
                <loadBalancerId>aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee</loadBalancerId>
                <loadBalancerName>load-balancer-name</loadBalancerName>
                <loadBalancerAlgorithm>ROUND_ROBIN</loadBalancerAlgorithm>
                <ip>ip</ip>              
            </request>
        </ws:updateLoadBalancer>
    </soapenv:Body>
</soapenv:Envelope>